In [1]:
import pandas as pd
import ast

### Nombre de titres d’achievement par pays ?

In [2]:
players=pd.read_csv("final/players.csv")

In [3]:
history=pd.read_csv("final/history.csv")

In [4]:
history.head()

,Unnamed: 0,playerid,achievementid,date_acquired,plateforme,acquired_year
0,0,1911732_playstation,670209_5436079,2024-11-28 10:23:24,playstation,2024
1,1,1911732_playstation,670209_5436078,2024-11-28 09:36:41,playstation,2024
2,2,1911732_playstation,670209_5436077,2024-11-28 08:31:54,playstation,2024
3,3,1911732_playstation,670209_5436076,2024-11-28 08:19:23,playstation,2024
4,4,1911732_playstation,658551_5368954,2024-10-05 13:12:35,playstation,2024

In [5]:
# reduire le nombre de colonnes 

history=history[['playerid', 'achievementid']]
history.head()

              playerid   achievementid
0  1911732_playstation  670209_5436079
1  1911732_playstation  670209_5436078
2  1911732_playstation  670209_5436077
3  1911732_playstation  670209_5436076
4  1911732_playstation  658551_5368954

In [6]:
players.head()

,Unnamed: 0,playerid,country,plateforme,created,created_year
0,0,2744567_playstation,Croatia,playstation,unknown,NaN
1,1,328452_playstation,United States,playstation,unknown,NaN
2,2,2521482_playstation,United Kingdom,playstation,unknown,NaN
3,3,390175_playstation,"Korea, Republic of",playstation,unknown,NaN
4,4,4348945_playstation,Russian Federation,playstation,unknown,NaN

In [7]:
# reduire le nombre de colonnes pour question de memoire ordinateur et faire le merge

players=players[['playerid', 'country']]
players.head()

              playerid             country
0  2744567_playstation             Croatia
1   328452_playstation       United States
2  2521482_playstation      United Kingdom
3   390175_playstation  Korea, Republic of
4  4348945_playstation  Russian Federation

In [8]:
# merge player et history sur le playerid 

players_history=players.merge(
  history,
  left_on =['playerid'],
  right_on =['playerid'],
  how='left'    
)

In [9]:
players_history.head()

              playerid             country achievementid
0  2744567_playstation             Croatia           NaN
1   328452_playstation       United States           NaN
2  2521482_playstation      United Kingdom           NaN
3   390175_playstation  Korea, Republic of           NaN
4  4348945_playstation  Russian Federation           NaN

In [10]:
players_history.shape

(46520773, 3)

In [11]:
players_history.isnull().sum()

playerid               0
country                0
achievementid    1040911
dtype: int64

In [16]:


# Réponse a la quesiton :  Nombre de titres d’achievement par pays ?

achievements_per_country = players_history.groupby("country")["achievementid"].nunique().reset_index().sort_values('achievementid', ascending=False)

# achievements_per_country.columns = ["country", "number_of_achievements"]

In [15]:
achievements_per_country

           country  achievementid
82         Germany         863526
248        unknown         841988
234  United States         584945
111          Japan         579918
30          Brazil         501361
..             ...            ...
197     Seychelles              0
112         Jersey              0
195        Senegal              0
116       Kiribati              0
125        Liberia              0

[250 rows x 2 columns]

In [18]:
# enregistrer en csv 

achievements_per_country.to_csv("powerbi/nb_achievement_par_pays.csv")